In [1]:
import pandas as pd
from sklearn.cluster import KMeans
from sklearn.metrics import silhouette_score

# read dataset
data = pd.read_csv("C://Users//hp//Downloads//data cse.csv")

In [2]:
data.head(5)

  CustomerID  Age  Income (INR) (in lakhs per annum) Demography  Gender
0       CUS1   25                                  5      Rural    Male
1       CUS2   30                                 10      Urban    Male
2       CUS3   25                                  8      Rural  Female
3       CUS4   35                                 15      Rural  Female
4       CUS5   45                                 20      Urban  Female

In [3]:
# finding the number of rows and columns
data.shape

(8, 5)

In [4]:
# getting some informations about the dataset
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column                             Non-Null Count  Dtype
---  ------                             --------------  -----
 0   CustomerID                         8 non-null      object
 1   Age                                8 non-null      int64
 2   Income (INR) (in lakhs per annum)  8 non-null      int64
 3   Demography                         8 non-null      object
 4   Gender                             8 non-null      object
dtypes: int64(2), object(3)
memory usage: 452.0+ bytes

In [5]:
# checking for missing value
data.isnull().sum()

CustomerID                           0
Age                                  0
Income (INR) (in lakhs per annum)    0
Demography                           0
Gender                               0
dtype: int64

In [6]:
data.drop(['CustomerID'],axis=1,inplace=True)
data.head(5)

   Age  Income (INR) (in lakhs per annum) Demography  Gender
0   25                                  5      Rural    Male
1   30                                 10      Urban    Male
2   25                                  8      Rural  Female
3   35                                 15      Rural  Female
4   45                                 20      Urban  Female

In [7]:
#performing label encoding for categorical variables
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
data['Gender']=data['Gender'].map({'Male':0,'Female':1}).astype(int) 
data['Demography']=le.fit_transform(data['Demography'])
data.head(5)

   Age  Income (INR) (in lakhs per annum)  Demography  Gender
0   25                                  5           0       0
1   30                                 10           1       0
2   25                                  8           0       1
3   35                                 15           0       1
4   45                                 20           1       1

In [8]:
#feature scalling
from sklearn.preprocessing import StandardScaler

In [9]:
sc=StandardScaler()

In [10]:
data['Age']=sc.fit_transform(data[['Age']])
data['Income (INR) (in lakhs per annum)']=sc.fit_transform(data[['Income (INR) (in lakhs per annum)']])

In [11]:
data.head(5)

        Age  Income (INR) (in lakhs per annum)  Demography  Gender
0 -0.872357                          -1.166880           0       0
1 -0.237915                          -0.286216           1       0
2 -0.872357                          -0.638482           0       1
3  0.396526                           0.594448           0       1
4  1.665408                           1.475113           1       1

In [12]:
#Calculate silhouetee score
from sklearn.metrics import silhouette_score

silhouette_score(data, KMeans(n_clusters =2).fit_predict(data))

C:\Users\hp\anaconda3\Lib\site-packages\sklearn\cluster\_kmeans.py:1412: FutureWarning: The default value of `n_init` will change from 10 to 'auto' in 1.4. Set the value of `n_init` explicitly to suppress the warning
  super()._check_params_vs_input(X, default_n_init=10)
C:\Users\hp\anaconda3\Lib\site-packages\sklearn\cluster\_kmeans.py:1436: UserWarning: KMeans is known to have a memory leak on Windows with MKL, when there are less chunks than available threads. You can avoid it by setting the environment variable OMP_NUM_THREADS=1.
  warnings.warn(

0.45495289647521314

In [13]:
kmeans = KMeans(n_clusters = 2)
clusters = kmeans.fit_predict(data)

C:\Users\hp\anaconda3\Lib\site-packages\sklearn\cluster\_kmeans.py:1412: FutureWarning: The default value of `n_init` will change from 10 to 'auto' in 1.4. Set the value of `n_init` explicitly to suppress the warning
  super()._check_params_vs_input(X, default_n_init=10)
C:\Users\hp\anaconda3\Lib\site-packages\sklearn\cluster\_kmeans.py:1436: UserWarning: KMeans is known to have a memory leak on Windows with MKL, when there are less chunks than available threads. You can avoid it by setting the environment variable OMP_NUM_THREADS=1.
  warnings.warn(

In [14]:
clusters

array([1, 1, 1, 0, 0, 1, 0, 1])

In [15]:
data["Cluster"] = clusters

In [16]:
data.head(10)

        Age  Income (INR) (in lakhs per annum)  Demography  Gender  Cluster
0 -0.872357                          -1.166880           0       0        1
1 -0.237915                          -0.286216           1       0        1
2 -0.872357                          -0.638482           0       1        1
3  0.396526                           0.594448           0       1        0
4  1.665408                           1.475113           1       1        0
5 -1.506798                          -1.166880           1       0        1
6  1.030967                           1.475113           1       1        0
7  0.396526                          -0.286216           0       0        1